---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainer.GetBasicIEnumerator
source: html/53f23133-175e-f3ce-f58d-a77358ca5129.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.